---
kind: type
id: T:Autodesk.Revit.DB.CategorySet
source: html/86e34e2f-3348-3d5c-1a6b-2ea485a1890e.htm
---
# Autodesk.Revit.DB.CategorySet

A set that can contains Category objects.

## Syntax (C#)
```csharp
public class CategorySet : APIObject,
	IEnumerable
```